import React from 'react'
import styles from "./footer.module.css"
import { Link } from 'react-router-dom'
const Footer = () => {
    return (
        <footer className='footer'>
            <div className="container">
                <div className={styles.quest}>
                    <h1>Часто задаваемые <span>вопросы</span></h1>
                    <ul>
                        <li>Вы доставляете по всей России?</li>
                        <li>А на бумаге печатаете?</li>
                        <li>Можно сделать принт на своей вещи?</li>
                        <li>Как быстро сможете произвести заказ?</li>
                        <li>Можно заказать одну какую-то позицию?</li>
                        <li>Из-за заграницы можно заказать?</li>
                        <li>Можно организовать самовывоз?</li>
                        <li>А если я не юр лицо, будем сотрудничать?</li>
                    </ul>
                    <button className={styles.moreQuest}>Больше вопросов
                        <svg width="11.000000" height="14.000000" viewBox="0 0 11 14" fill="none" xmlns="http://www.w3.org/2000/svg" xmlnsXlink="http://www.w3.org/1999/xlink">
                            <defs />
                            <path id="Icon" d="M-0.66 4.9C-0.42 2.03 1.98 -0.17 4.85 -0.17L5.14 -0.17C8.01 -0.17 10.41 2.03 10.64 4.9C10.77 6.44 10.3 7.97 9.32 9.16L6.12 13.07C5.54 13.78 4.45 13.78 3.87 13.07L0.67 9.16C-0.31 7.97 -0.78 6.44 -0.66 4.9ZM4.85 0.83C2.5 0.83 0.53 2.63 0.34 4.98C0.23 6.26 0.63 7.54 1.44 8.53L4.64 12.44C4.82 12.66 5.17 12.66 5.35 12.44L8.54 8.53C9.36 7.54 9.75 6.26 9.65 4.98C9.46 2.63 7.49 0.83 5.14 0.83L4.85 0.83ZM3.83 5.38C3.83 4.69 4.36 4.16 5 4.16C5.62 4.16 6.16 4.69 6.16 5.38C6.16 5.91 5.83 6.36 5.38 6.52C4.99 6.67 4.5 7.05 4.5 7.66C4.5 7.94 4.72 8.16 5 8.16C5.27 8.16 5.5 7.94 5.5 7.66C5.5 7.65 5.5 7.63 5.53 7.58C5.58 7.54 5.64 7.49 5.73 7.46C6.57 7.15 7.16 6.33 7.16 5.38C7.16 4.17 6.2 3.16 5 3.16C3.78 3.16 2.83 4.17 2.83 5.38C2.83 5.65 3.05 5.88 3.33 5.88C3.6 5.88 3.83 5.65 3.83 5.38ZM5.66 9.66C5.66 10.03 5.36 10.33 5 10.33C4.62 10.33 4.33 10.03 4.33 9.66C4.33 9.29 4.62 9 5 9C5.36 9 5.66 9.29 5.66 9.66Z" fill="#000000" fillOpacity="1.000000" fillRule="evenodd" />
                        </svg>
                    </button>
                </div>

                <div className={styles.helper}>
                    <div className={styles.helperText}>
                        <h2>Нужна <span>помощь</span>?</h2>
                        <p>Оставьте свои данные — мы перезвоним и решим вопрос. Помните, оставляя контакты вы даете согласие на обработку персональных данных.</p>
                    </div>
                    <div className={styles.helperForm}>
                        <label>
                            <p>Имя</p>
                            <input type="text" placeholder='Ваше имя' className={styles.bigInp} />
                        </label>
                        <label>
                            <p>Телефон</p>
                            <div>                     <input type="text" placeholder='+7 000 000 00 00' className={styles.miniInp} />
                                <button className={styles.arrowRight}>
                                    <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" fill="#000" viewBox="0 0 16 16">
                                        <path fillRule="evenodd" d="M1 8a.5.5 0 0 1 .5-.5h11.793l-3.147-3.146a.5.5 0 0 1 .708-.708l4 4a.5.5 0 0 1 0 .708l-4 4a.5.5 0 0 1-.708-.708L13.293 8.5H1.5A.5.5 0 0 1 1 8" />
                                    </svg>
                                </button></div>
                        </label>
                    </div>
                </div>
            </div>

            <div className={styles.megaFooter}>
                <div className={styles.megaFooterInner}>
                    <Link to={'/'}><img src={require('../images/logotype.png')} alt="Logo" /></Link>
                    <ul className={styles.firstList}>
                        <div>
                            <li>О компании</li>
                            <li>Портфолио</li>
                            <li>Вакансии</li>
                            <li>Диллерам</li>
                            <li>Гарантия</li>
                        </div>
                        <div>
                            <li>Контакты</li>
                            <li>Акции</li>
                            <li>Производство</li>
                            <li>Доставка и оплата</li>
                            <li>Обмен и возврат</li>
                        </div>
                    </ul>

                    <ul className={styles.secondList}>

                        <div className={styles.chtoTutProsihodit}>
                            <span className={styles.secondTitle}>Услуги</span>
                            <li>Шелкография</li>
                            <li>Тампопечать</li>
                            <li>Гравировка</li>
                            <li>Печать на сумках</li>
                        </div>
                        <div className={styles.innerOne}>
                            <div className={styles.innerTwo}>
                                <li>Гравировка</li>
                                <li>Тиснение</li>
                                <li>Клише</li>
                                <li>Полноцветная печать</li>
                            </div>
                            <div className={styles.innerTwo}>
                                <li>Полимерная заливка</li>
                                <li>Услуги дизайнера</li>
                                <li>Запись на USB</li>
                            </div>
                        </div>
                    </ul>


                </div>
                <hr />
                <div className={styles.footerDno}>

                        <div className={styles.dnoZero}>
                        <a href=""><svg width="20.000000" height="20.000000" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg" xmlnsXlink="http://www.w3.org/1999/xlink">
                        <defs />
                        <path id="Icon" d="M5.62 2.36C8.5 2.03 11.49 2.03 14.38 2.36C16.05 2.54 17.41 3.86 17.6 5.55C17.95 8.5 17.95 11.49 17.6 14.44C17.41 16.13 16.05 17.45 14.38 17.63C11.49 17.96 8.5 17.96 5.62 17.63C3.94 17.45 2.58 16.13 2.39 14.44C2.04 11.49 2.04 8.5 2.39 5.55C2.58 3.86 3.94 2.54 5.62 2.36ZM14.24 3.6C11.44 3.29 8.55 3.29 5.75 3.6C4.64 3.72 3.76 4.6 3.63 5.69C3.3 8.55 3.3 11.44 3.63 14.3C3.76 15.39 4.64 16.27 5.75 16.39C8.55 16.7 11.44 16.7 14.24 16.39C15.35 16.27 16.24 15.39 16.36 14.3C16.7 11.44 16.7 8.55 16.36 5.69C16.24 4.6 15.35 3.72 14.24 3.6ZM13.33 5.83C13.33 5.37 13.7 5 14.16 5C14.62 5 15 5.37 15 5.83C15 6.29 14.62 6.66 14.16 6.66C13.7 6.66 13.33 6.29 13.33 5.83ZM10 6.04C7.81 6.04 6.04 7.81 6.04 10C6.04 12.18 7.81 13.95 10 13.95C12.18 13.95 13.96 12.18 13.96 10C13.96 7.81 12.18 6.04 10 6.04ZM7.29 10C7.29 8.5 8.5 7.29 10 7.29C11.49 7.29 12.71 8.5 12.71 10C12.71 11.49 11.49 12.7 10 12.7C8.5 12.7 7.29 11.49 7.29 10Z" fill="#487B6C" fillOpacity="1.000000" fillRule="evenodd" />
                    </svg>


                    </a>
                    <a href=""><svg width="9.000000" height="17.000000" viewBox="0 0 9 17" fill="none" xmlns="http://www.w3.org/2000/svg" xmlnsXlink="http://www.w3.org/1999/xlink">
                        <defs />
                        <path id="Icon" d="M2.73 1.15C3.55 0.33 4.67 -0.13 5.83 -0.13L8.08 -0.13C8.42 -0.13 8.7 0.15 8.7 0.5L8.7 3.5C8.7 3.84 8.42 4.12 8.08 4.12L5.83 4.12C5.8 4.12 5.76 4.13 5.74 4.16C5.71 4.18 5.7 4.21 5.7 4.25L5.7 5.87L8.08 5.87C8.27 5.87 8.45 5.96 8.57 6.11C8.69 6.26 8.73 6.46 8.68 6.65L7.93 9.65C7.86 9.92 7.61 10.12 7.33 10.12L5.7 10.12L5.7 15.5C5.7 15.84 5.42 16.12 5.08 16.12L2.08 16.12C1.73 16.12 1.45 15.84 1.45 15.5L1.45 10.12L-0.17 10.12C-0.52 10.12 -0.8 9.84 -0.8 9.5L-0.8 6.5C-0.8 6.15 -0.52 5.87 -0.17 5.87L1.45 5.87L1.45 4.25C1.45 3.08 1.91 1.97 2.73 1.15ZM5.83 1.12C5 1.12 4.2 1.45 3.62 2.04C3.03 2.62 2.7 3.42 2.7 4.25L2.7 6.5C2.7 6.84 2.42 7.12 2.08 7.12L0.45 7.12L0.45 8.87L2.08 8.87C2.42 8.87 2.7 9.15 2.7 9.5L2.7 14.87L4.45 14.87L4.45 9.5C4.45 9.15 4.73 8.87 5.08 8.87L6.84 8.87L7.28 7.12L5.08 7.12C4.73 7.12 4.45 6.84 4.45 6.5L4.45 4.25C4.45 3.88 4.6 3.53 4.85 3.27C5.11 3.02 5.46 2.87 5.83 2.87L7.45 2.87L7.45 1.12L5.83 1.12Z" fill="#487B6C" fillOpacity="1.000000" fillRule="evenodd" />
                    </svg>
                    </a>
                    <a href=""><svg width="17.000000" height="13.000000" viewBox="0 0 17 13" fill="none" xmlns="http://www.w3.org/2000/svg" xmlnsXlink="http://www.w3.org/1999/xlink">
                        <defs />
                        <path id="Icon" d="M3.8 -0.14C6.59 -0.36 9.4 -0.36 12.19 -0.14L14.05 0.01C15.19 0.1 16.12 0.95 16.31 2.07C16.74 4.67 16.74 7.32 16.31 9.92C16.12 11.04 15.19 11.89 14.05 11.98L12.19 12.13C9.4 12.35 6.59 12.35 3.8 12.13L1.94 11.98C0.8 11.89 -0.13 11.04 -0.32 9.92C-0.75 7.32 -0.75 4.67 -0.32 2.07C-0.13 0.95 0.8 0.1 1.94 0.01L3.8 -0.14ZM12.09 1.11C9.37 0.9 6.63 0.9 3.9 1.11L2.03 1.26C1.47 1.3 1.01 1.72 0.92 2.28C0.51 4.74 0.51 7.25 0.92 9.71C1.01 10.27 1.47 10.69 2.03 10.74L3.9 10.88C6.63 11.09 9.37 11.09 12.09 10.88L13.96 10.74C14.52 10.69 14.98 10.27 15.07 9.71C15.48 7.25 15.48 4.74 15.07 2.28C14.98 1.72 14.52 1.3 13.96 1.26L12.09 1.11ZM6.02 2.95C6.22 2.84 6.46 2.84 6.65 2.96L10.82 5.46C11.01 5.57 11.12 5.78 11.12 6C11.12 6.21 11.01 6.42 10.82 6.53L6.65 9.03C6.46 9.15 6.22 9.15 6.02 9.04C5.82 8.93 5.7 8.72 5.7 8.5L5.7 3.5C5.7 3.27 5.82 3.06 6.02 2.95ZM6.95 7.39L9.28 6L6.95 4.6L6.95 7.39Z" fill="#487B6C" fillOpacity="1.000000" fillRule="evenodd" />
                    </svg>
                    </a>
                        </div>

                    <div className={styles.dnoOne}>
                        <h3>Москва</h3>
                        <span>+7 (945) 133-16-28</span>
                    </div>

                                        <div className={styles.dnoOne}>
                        <h3>Улан-Удэ</h3>
                        <span>+7 (925) 272-83-08</span>
                    </div>

                        <div className={styles.dnoTwo}>
                            <h4><svg width="13.000000" height="14.000000" viewBox="0 0 13 14" fill="none" xmlns="http://www.w3.org/2000/svg" xmlnsXlink="http://www.w3.org/1999/xlink">
	<defs/>
	<path id="Icon" d="M6 -0.3C4.04 -0.3 2.46 1.29 2.46 3.25C2.46 5.2 4.04 6.79 6 6.79C7.95 6.79 9.54 5.2 9.54 3.25C9.54 1.29 7.95 -0.3 6 -0.3ZM3.71 3.25C3.71 1.98 4.73 0.95 6 0.95C7.26 0.95 8.29 1.98 8.29 3.25C8.29 4.51 7.26 5.54 6 5.54C4.73 5.54 3.71 4.51 3.71 3.25ZM2.66 8.04C0.94 8.04 -0.46 9.44 -0.46 11.16L-0.46 12.15C-0.46 12.78 -0.01 13.31 0.61 13.42C4.18 14 7.82 14 11.38 13.42C12 13.31 12.46 12.78 12.46 12.15L12.46 11.16C12.46 9.44 11.05 8.04 9.33 8.04L9.05 8.04C8.89 8.04 8.74 8.06 8.59 8.11L7.87 8.34C6.65 8.74 5.34 8.74 4.12 8.34L3.4 8.11C3.25 8.06 3.1 8.04 2.95 8.04L2.66 8.04ZM0.79 11.16C0.79 10.13 1.63 9.29 2.66 9.29L2.95 9.29C2.97 9.29 2.99 9.29 3.01 9.3L3.73 9.53C5.2 10.01 6.79 10.01 8.26 9.53L8.98 9.3C9 9.29 9.02 9.29 9.05 9.29L9.33 9.29C10.37 9.29 11.21 10.13 11.21 11.16L11.21 12.15C11.21 12.17 11.19 12.18 11.18 12.18C7.75 12.74 4.25 12.74 0.82 12.18C0.8 12.18 0.79 12.17 0.79 12.15L0.79 11.16Z" fill="#487B6C" fill-opacity="1.000000" fill-rule="evenodd"/>
</svg>
      Личный кабинет</h4>
                            <span>info@reklem.ru</span>
                        </div>


                        <div className={styles.dnoTwo}>
                            <h4><svg width="13.000000" height="17.000000" viewBox="0 0 13 17" fill="none" xmlns="http://www.w3.org/2000/svg" xmlnsXlink="http://www.w3.org/1999/xlink">
	<defs/>
	<path id="Icon" d="M-0.46 2.16C-0.46 0.9 0.57 -0.13 1.83 -0.13L8.5 -0.13C8.96 -0.13 9.39 0.08 9.66 0.45L12.16 3.76C12.35 4.01 12.46 4.32 12.46 4.63L12.46 13.83C12.46 15.09 11.43 16.12 10.16 16.12L1.83 16.12C0.57 16.12 -0.46 15.09 -0.46 13.83L-0.46 2.16ZM1.83 1.12C1.25 1.12 0.79 1.59 0.79 2.16L0.79 13.83C0.79 14.4 1.25 14.87 1.83 14.87L10.16 14.87C10.74 14.87 11.21 14.4 11.21 13.83L11.21 5.41L8.5 5.41C8.15 5.41 7.87 5.13 7.87 4.78L7.87 1.12L1.83 1.12ZM9.12 8.83C9.12 8.48 8.84 8.2 8.5 8.2L3.5 8.2C3.15 8.2 2.87 8.48 2.87 8.83C2.87 9.17 3.15 9.45 3.5 9.45L8.5 9.45C8.84 9.45 9.12 9.17 9.12 8.83ZM9.12 12.16C9.12 11.82 8.84 11.54 8.5 11.54L3.5 11.54C3.15 11.54 2.87 11.82 2.87 12.16C2.87 12.51 3.15 12.79 3.5 12.79L8.5 12.79C8.84 12.79 9.12 12.51 9.12 12.16Z" fill="#487B6C" fill-opacity="1.000000" fill-rule="evenodd"/>
</svg>
    Обработка данных</h4>
                            <span>© Copyright 2021</span>
                        </div>

                </div>
            </div>

        </footer>
    )
}

export default Footer
